#+TITLE: Unix Workshop
#+DATE:<2016-12-05 Mon> 
#+AUTHOR: Antwane Mason, Yuriy Stejko
#+EMAIL: ad.mason1413@gmail.com
#+LATEX_CLASS: beamer
#+BEAMER_THEME: Madrid
# The following line gives access to the C-c C-b key for headings
#+startup: beamer
** Example                                                          :B_block:
   :PROPERTIES:
   :BEAMER_env: block
   :END:
#+begin_src shell :results output :exports both :cache
ps
#+end_src 

#+RESULTS:
#+begin_example
  PID TTY          TIME CMD
 3037 ?        00:00:00 systemd
 3040 ?        00:00:00 (sd-pam)
 3046 ?        00:00:00 gnome-keyring-d
 3048 ?        00:00:00 upstart
 3127 ?        00:00:00 upstart-udev-br
 3135 ?        00:00:06 dbus-daemon
 3148 ?        00:00:00 window-stack-br
 3176 ?        00:00:01 upstart-dbus-br
 3178 ?        00:00:02 upstart-dbus-br
 3182 ?        00:00:00 upstart-file-br
 3197 ?        00:00:51 ibus-daemon
 3205 ?        00:00:05 bamfdaemon
 3213 ?        00:00:00 gvfsd
 3218 ?        00:00:00 gvfsd-fuse
#+end_example

** Example                                                          :B_block:
   :PROPERTIES:
   :BEAMER_env: block
   :END:
#+begin_src shell :results output :exports both 
ls -tl  
#+end_src 

#+RESULTS:
#+begin_example
total 158400
-rw-rw-r-- 1 antwane antwane     6119 Dec  5 17:51 unix-workshop.org
-rw-rw-r-- 1 antwane antwane   262228 Dec  5 17:49 unix-workshop.pdf
drwxrwxr-x 2 antwane antwane     4096 Dec  5 17:49 auto
-rw-rw-r-- 1 antwane antwane     7238 Dec  5 17:49 unix-workshop.tex
-rw-rw-r-- 1 antwane antwane     6036 Dec  5 17:49 unix-workshop.org.~43~
-rw-rw-r-- 1 antwane antwane     7056 Dec  5 17:48 unix-workshop.tex.~37~
-rw-rw-r-- 1 antwane antwane     5825 Dec  5 17:47 unix-workshop.org.~42~
#+end_example


** Example                                                          :B_block:
   :PROPERTIES:
   :BEAMER_env: block
   :END:
#+begin_src shell :results output :exports both :cache
wc -lwc unix-workshop.org
#+end_src 

#+RESULTS:
:   74  205 1677 unix-workshop.org

** Example                                                       :B_block:
   :PROPERTIES:
   :BEAMER_env: block
   :END:
#+begin_src shell :results output :exports both :cache
apropos download
#+end_src  

#+RESULTS:
: arm2hpdl (1)         - Add HP download header/trailer to an ARM ELF binary.
: git-fetch (1)        - Download objects and refs from another repository
: git-http-fetch (1)   - Download from a remote Git repository via HTTP
: hp-firmware (1)      - Firmware Download Utility
: hp-plugin (1)        - Plugin Download and Install Utility
: lwp-download (1p)    - Fetch large files from the web
: update-pciids (8)    - download new version of the PCI ID list
: update-usbids (8)    - download new version of the USB ID list
: wget (1)             - The non-interactive network downloader.





